app/controllers/artworks_controller.rb

    def index

        if params[:user_id]
            @user = User.find(params[:user_id])

            render json: (@user.artworks + @user.shared_artworks).uniq
        else
            render json: Artwork.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "\"circles in a circle\""], ["image_url", "\"e\""], ["artist_id", 12]]

    def show
        @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "circles in a circle"], ["image_url", "e"], ["id", 11]]

    def destroy
        @artwork = Artwork.find(params[:id])
        @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 11]]