app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        @artwork_shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 7], ["viewer_id", 11]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @artwork_share = ArtworkShare.find(params[:id])

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]
---
    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy