app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:comment_id]
            @artwork = Artwork.find(params[:artwork_id])

            render json: @artwork.comments
        elsif params[:user_id]
            @user = User.find(params[:user_id])
            render json: @user.comments
        else
            render json: Comment.all