app/controllers/users_controller.rb

    def index

        if params[:username]
            @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "a"], ["LIMIT", 1]]