app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jeff"], ["email", "jeff@jeff.com"], ["created_at", "2020-04-22 19:29:11.372846"], ["updated_at", "2020-04-22 19:29:11.372846"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "barry"], ["updated_at", "2020-04-22 20:16:26.738327"], ["id", 3]]

    def destroy
        @user = User.find(params[:id])
        @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]